OpenFOAM_12_cases/catalystHeatUp/0.orig/SCR1/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.org                      |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0/SCR1";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform 100000;
    }
    SCR1_to_region3
    {
        type            calculated;
        value           uniform 100000;
    }
    SCR1_to_region2
    {
        type            calculated;
        value           uniform 100000;
    }
}


// ************************************************************************* //
